Revit 2024 API
ParameterTypeId.RebarElementVisibility Property
 "View Visibility States"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RebarElementVisibility { get; }
Visual Basic
Public Shared ReadOnly Property RebarElementVisibility As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RebarElementVisibility {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace